/*****************************************************************
 *
 * ЙІФмТыЖЈвхЕФЭЗЮФМў
 * 
 * Time-stamp: <2012-08-20 08:57:13  Shisheng.Zhi, 0354>
 * 
 *
 *
 *
 *****************************************************************/

#ifndef __F_FUNCCODE_H__
#define __F_FUNCCODE_H__



       // 2803xЛЙЪЧ2808ЦНЬЈ
//#include "DSP28x_Project.h"

#include "f_debug.h"
#include "f_interface.h"
#include "f_p2p.h"

#if 1
#define DISP_FRQ_RUN            0   //  0, дЫааЦЕТЪ
#define DISP_FRQ_AIM            1   //  1, ЩшЖЈЦЕТЪ
#define DISP_OUT_CURRENT        4   //  4, ЪфГіЕчСї
#define DISP_OUT_POWER          5   //  5, ЪфГіЙІТЪ
#define DISP_FRQ_RUN_FDB        19  //  19,ЗДРЁЫйЖШ
#define DISP_FRQ_COMM           28  //  28,ЭЈбЖЩшЖЈжЕ
#define DISP_P2P_COMM_SEND      63  //  63,ЕуЖдЕуЭЈбЖЪ§ОнЗЂЫЭ
#define DISP_P2P_COMM_REV       64  //  64,ЕуЖдЕуЭЈбЖЪ§ОнНгЪе
#define DISP_FRQ_FDB            29  //  29,ЗДРЁЫйЖШ 
#define DISP_FRQ_X              30  //  30, жїЦЕТЪXЯдЪО
#define DISP_FRQ_Y              31  //  31, ИЈжњЦЕТЪYЯдЪО
#define DISP_LOAD_SPEED         14  //  дЫааЪБИКдиЫйЖШЯдЪОЕФbitЮЛжУ

#define DISP_DI_STATUS_SPECIAL1 41  // DIЪфШызДЬЌжБЙлЯдЪОЃЌDI1-DI19,VDI1
#define DISP_DO_STATUS_SPECIAL1 42  // DOЪфШызДЬЌжБЙлЯдЪОЃЌR1-R10,DO1,R11,R12,VDO1-VDO5
#define DISP_DI_FUNC_SPECIAL1   43  // DIЙІФмзДЬЌжБЙлЯдЪО1ЃЌЙІФм01-ЙІФм40
#define DISP_DI_FUNC_SPECIAL2   44  // DIЙІФмзДЬЌжБЙлЯдЪО2ЃЌЙІФм41-ЙІФм80

extern const uint16_t stopDispIndex[];
#endif

// ЧыВЛвЊЫцвтаоИФетСНИіжЕЃЌЗёдђEEPROMжаЕФжЕЛсШЋВП(АќРЈP0зщЁЂP1зщЁЂИїжжМЧТМ)ЛжИДГіГЇжЕЁЃ
#define EEPROM_CHECK1       (0x0009)                        // EEPROMаЃбщзж1
#define EEPROM_CHECK2       (0xFFFF - EEPROM_CHECK1)        // EEPROMаЃбщзж2


#define USER_MENU_GROUP     FUNCCODE_GROUP_FE

// ЛёЕУЙІФмТыcodeдкШЋВПЙІФмТыжаЕФindexЃЌМДЙІФмТыдкЪ§зщfuncCode.all[]жаЕФЯТБъЁЃ
// ИљОн FUNCCODE_ALL ЕФЖЈвхЃЌвЛИіЙІФмТыЕФБэЪОга4жжАьЗЈЃЌЖдгІЕФЛёЕУindexЕФАьЗЈЃК
// 1. funcCode.all[i]     ---- i
// 2. funcCode.f5[7]      ---- GetCodeIndex(funcCode.group.f5[7])
// 3. group, grade        ---- GetGradeIndex(group, grade)
// 4. funcCode.code.maxFrq---- GetCodeIndex(funcCode.code.maxFrq)
#define GetCodeIndex(code)    ((Uint16)((&(code)) - (&(funcCode.all[0]))))
#define GetGradeIndex(group, grade)  (funcCodeGradeSum[group] + (grade))


//=====================================================================
// ЙІФмТыЪєадЮЛЖЈвх
//
// ЕЅЮЛ
#define ATTRIBUTE_UNIT_HZ_BIT           0
#define ATTRIBUTE_UNIT_A_BIT            1
#define ATTRIBUTE_UNIT_V_BIT            2

// ЖСаДЪєад
#define ATTRIBUTE_READ_AND_WRITE        0   // (ШЮКЮЪБКђ)ПЩаД
#define ATTRIBUTE_READ_ONLY_WHEN_RUN    1   // дЫааЪБжЛЖС
#define ATTRIBUTE_READ_ONLY_ANYTIME     2   // жЛЖС

// ЖрЙІФмТызщКЯЪєад
#define ATTRIBUTE_MULTI_LIMIT_SINGLE    0   // ЕЅЖРЕФЙІФмТы
#define ATTRIBUTE_MULTI_LIMIT_DEC       1   // ЖрИіЙІФмТыЃЌЪЎНјжЦ
#define ATTRIBUTE_MULTI_LIMIT_HEX       2   // ЖрИіЙІФмТыЃЌЪЎСљНјжЦ

struct  FUNC_ATTRIBUTE_BITS
{                           // bits   description
    Uint16 point:3;         // 2:0    radix point,аЁЪ§ЕуЁЃ
                            //        0-ЮоаЁЪ§ЕуЃЌ1-1ЮЛаЁЪ§ЃЌ...ЃЌ4-4ЮЛаЁЪ§
                            //        (0.0000-100,00.000-011,000.00-010,0000.0-001,00000-000)
    Uint16 unit:3;          // 5:3    unit,ЕЅЮЛ
                            //        1-hz, 2-A, 3-RPM, 4-V, 6-%; 001-Hz, 010-A, 100-V
    Uint16 displayBits:3;   // 8:6    5ИіЪ§ТыЙмвЊЯдЪОЕФЮЛЪ§ЁЃ0-ЯдЪО0ЮЛЃЌ1-ЯдЪО1ЮЛЃЌ...ЃЌ5-ЯдЪО5ЮЛ
    Uint16 upperLimit:1;    // 9      1-ВЮЪ§гЩЩЯЯоЯрЙиЙІФмТыЯожЦЃЌ0-жБНггЩЩЯЯоЯожЦ
    Uint16 lowerLimit:1;    // 10     1-ВЮЪ§гЩЯТЯоЯрЙиЙІФмТыЯожЦЃЌ0-жБНггЩЯТЯоЯожЦ
    Uint16 writable:2;      // 12:11  ВЮЪ§ЖСаДЬиадЃЌ00-ПЩвдЖСаД, 01-дЫаажажЛЖСЃЌ10-ВЮЪ§жЛЖС
    Uint16 signal:1;        // 13     ЗћКХЃЌunsignal-0; signal-1
    Uint16 multiLimit:2;    // 15:14  ИУЙІФмТыЮЊЖрИіЙІФмТыЕФзщКЯ. 
                            //        00-ЕЅЖРЙІФмТы(ЗЧзщКЯ); 
                            //        01-ЪЎНјжЦ,  ЖрИіЙІФмТыЕФзщКЯ; 
                            //        10-ЪЎСљНјжЦ,ЖрИіЙІФмТыЕФзщКЯ; 
};

union FUNC_ATTRIBUTE
{
   Uint16                      all;
   struct FUNC_ATTRIBUTE_BITS  bit;
};
//=====================================================================



//=====================================================================
// ЙІФмТыЪєадБэЃКЩЯЯоЁЂЯТЯоЁЂЪєад
// ЙІФмТыЕФГіГЇжЕЃЌАќРЈEEPROM_CHECKЁЂЕєЕчМЧвфЃЌЕЋВЛАќРЈЯдЪОзщ
typedef struct FUNCCODE_ATTRIBUTE_STRUCT
{
    Uint16                  lower;          // ЯТЯо
    Uint16                  upper;          // ЩЯЯо
    Uint16                  init;           // ГіГЇжЕ
    union FUNC_ATTRIBUTE    attribute;      // Ъєад

    Uint16                  eepromIndex;    // ЖдгІEEPROMДцДЂЕФindex
} FUNCCODE_ATTRIBUTE;

extern const FUNCCODE_ATTRIBUTE funcCodeAttribute[];
//=====================================================================



//=====================================================================
// ЙІФмТыЕФcodeЕФвЛаЉЪ§ОнНсЙЙЖЈвх
struct PLC_STRUCT
{
    Uint16 runTime;         // PLCЕк_ЖЮдЫааЪБМф
    Uint16 accDecTimeSet;   // PLCЕк_ЖЮМгМѕЫйЪБМфбЁдё
};
//=================================


//=================================
struct AI_SET_CURVE  // AIЩшЖЈЧњЯп
{
    Uint16 minIn;       // ЧњЯпзюаЁЪфШы(ЕчбЙжЕ)
    Uint16 minInSet;    // ЧњЯпзюаЁЪфШыЖдгІЩшЖЈ(АйЗжБШ)
    Uint16 maxIn;       // ЧњЯпзюДѓЪфШы(ЕчбЙжЕ)
    Uint16 maxInSet;    // ЧњЯпзюДѓЪфШыЖдгІЩшЖЈ(АйЗжБШ)
};
//=================================


//=================================
struct AI_JUMP
{
    Uint16 point;   // ЩшЖЈЬјдОЕу
    Uint16 arrange; // ЩшЖЈЬјдОЗљЖШ
};
//=================================


//=================================
struct ANALOG_CALIBRATE_CURVE  // ФЃФтСПаЃе§ЧњЯпЃЌAIAO
{
    Uint16 before1;     // аЃе§ЧАЕчбЙ1
    Uint16 after1;      // аЃе§КѓЕчбЙ1
    
    Uint16 before2;     // аЃе§ЧАЕчбЙ2
    Uint16 after2;      // аЃе§КѓЕчбЙ2
};
//=================================


//=================================
typedef struct AO_PARA_STRUCT
{
    Uint16 offset;          // AOСуЦЋЯЕЪ§
    Uint16 gain;            // AOдівц
} AO_PARA;
//=================================


//=================================
struct FC_GROUP_HIDE_STRUCT
{
    Uint16 password;    // ЙІФмТызщвўВиЬиадУмТы
    
    Uint16 f;           // FзщвўВиЬиадЃЈF0-FFЃЉ
    Uint16 a;           // AзщвўВиЬиадЃЈA0-AFЃЉ
    Uint16 b;           // BзщвўВиЬиадЃЈB0-BFЃЉ
    Uint16 c;           // CзщвўВиЬиадЃЈC0-CFЃЉ
};
union FC_GROUP_HIDE
{
    Uint16 all[5];
    struct FC_GROUP_HIDE_STRUCT elem;
};
//=================================

//=================================

//=================================
struct ERROR_SCENE_STRUCT
{
    Uint16 errorFrq;                    // ЕкШ§ДЮ(зюНќвЛДЮ)ЙЪеЯЪБЦЕТЪ
    Uint16 errorCurrent;                // ЕкШ§ДЮ(зюНќвЛДЮ)ЙЪеЯЪБЕчСї
    Uint16 errorGeneratrixVoltage;      // ЕкШ§ДЮ(зюНќвЛДЮ)ЙЪеЯЪБФИЯпЕчбЙ
    Uint16 errorDiStatus;               // ЕкШ§ДЮ(зюНќвЛДЮ)ЙЪеЯЪБЪфШыЖЫзгзДЬЌ
    Uint16 errorDoStatus;               // ЕкШ§ДЮ(зюНќвЛДЮ)ЙЪеЯЪБЪфГіЖЫзгзДЬЌ
    
    Uint16 errorInverterStatus;         // ЕкШ§ДЮ(зюНќвЛДЮ)ЙЪеЯЪББфЦЕЦїзДЬЌ
    Uint16 errorTimeFromPowerUp;        // ЕкШ§ДЮ(зюНќвЛДЮ)ЙЪеЯЪБЪБМфЃЈДгБОДЮЩЯЕчПЊЪММЦЪБЃЉ
    Uint16 errorTimeFromRun;            // ЕкШ§ДЮ(зюНќвЛДЮ)ЙЪеЯЪБЪБМфЃЈДгдЫааЪБПЊЪММЦЪБЃЉ
};

union ERROR_SCENE
{
    Uint16 all[sizeof(struct ERROR_SCENE_STRUCT)];

    struct ERROR_SCENE_STRUCT elem;
};
//=================================


//=================================
#define APTP_NUM    32  // aptpЕуЪ§
typedef struct
{
    Uint16 low;     // aptpЕЭЮЛЃЌ0-9999
    Uint16 high;    // aptpИпЮЛЃЌ0-65535
} LENGTH_SET;
// ЗЖЮЇ: 0-655359999
//=================================


//=================================
#define MOTOR_TYPE_ACI_GENERAL  0   // ЦеЭЈвьВНЕчЛњ
#define MOTOR_TYPE_ACI_INV      1   // БфЦЕвьВНЕчЛњ
#define MOTOR_TYPE_PMSM         2   // гРДХЭЌВНЕчЛњ
struct MOTOR_PARA_STRUCT
{
    // ЕчЛњЛљБОВЮЪ§
    Uint16 motorType;               // F1-00  ЕчЛњРраЭбЁдё
    Uint16 ratingPower;             // F1-01  ЕчЛњЖюЖЈЙІТЪ
    Uint16 ratingVoltage;           // F1-02  ЕчЛњЖюЖЈЕчбЙ
    Uint16 ratingCurrent;           // F1-03  ЕчЛњЖюЖЈЕчСї
    Uint16 ratingFrq;               // F1-04  ЕчЛњЖюЖЈЦЕТЪ
    Uint16 ratingSpeed;             // F1-05  ЕчЛњЖюЖЈзЊЫй

    // вьВНЛњЕїаГВЮЪ§
    Uint16 statorResistance;        // F1-06  вьВНЛњЖЈзгЕчзш
    Uint16 rotorResistance;         // F1-07  вьВНЛњзЊзгЕчзш
    Uint16 leakInductance;          // F1-08  вьВНЛњТЉИаПЙ
    Uint16 mutualInductance;        // F1-09  вьВНЛњЛЅИаПЙ
    Uint16 zeroLoadCurrent;         // F1-10  вьВНЛњПедиЕчСї
    Uint16 rsvdF11[5];

    // ЭЌВНЛњЕїаГВЮЪ§
    Uint16 pmsmRs;                  // F1-16  ЭЌВНЛњЖЈзгЕчзш
    Uint16 pmsmLd;                  // F1-17  ЭЌВНЛњdжсЕчИа
    Uint16 pmsmLq;                  // F1-18  ЭЌВНЛњqжсЕчИа
    Uint16 pmsmRsLdUnit;            // F1-19  ЭЌВНЛњЕчИаЕчзшЕЅЮЛ
    Uint16 pmsmCoeff;               // F1-20  ЭЌВНЛњЗДЕчЖЏЪЦЯЕЪ§
    Uint16 pmsmCheckTime;           // F1-21  ЭЌВНЛњфГіШБЯрМьВтЪБМф
    Uint16 rsvdF12[5];
    
};

struct PG_PARA_STRUCT
{
    // PGПЈВЮЪ§
    Uint16 encoderPulse;            // F1-27    БрТыЦїТіГхЯпЪ§
    Uint16 pgType;                  // F1-28    БрТыЦїРраЭ
    Uint16 fvcPgSrc;                // F1-29    ЫйЖШЗДРЁPGПЈбЁдё, 0-QEP1,1-QEP2(РЉеЙ)    
    Uint16 enCoderDir;              // F1-30    БрТыЦїЯрађ/жїЗНЯђ
    Uint16 enCoderAngle;            // F1-31    БрТыЦїАВзАНЧ
    Uint16 uvwSignDir;              // F1-32    UVWаХКХЗНЯђ
    Uint16 uvwSignAngle;            // F1-33    UVWаХКХСуЕуЮЛжУНЧ
    Uint16 enCoderPole;             // F1-34    а§БфМЋЖдЪ§
    Uint16 rsvdF11;                 // F1-35    UVWМЋЖдЪ§ 
    Uint16 fvcPgLoseTime;           // F1-36    ЫйЖШЗДРЁPGЖЯЯпМьВтЪБМф    
};

union MOTOR_PARA
{
    Uint16 all[sizeof(struct MOTOR_PARA_STRUCT)];
    
    struct MOTOR_PARA_STRUCT elem;
};

union PG_PARA
{
    Uint16 all[sizeof(struct PG_PARA_STRUCT)];
    
    struct PG_PARA_STRUCT elem;
};

//=================================

//=================================
enum MOTOR_SN
{
    MOTOR_SN_1,     // Ек1ЕчЛњ
    MOTOR_SN_2,     // Ек2ЕчЛњ
    MOTOR_SN_3,     // Ек3ЕчЛњ
    MOTOR_SN_4      // Ек4ЕчЛњ
};
//=================================


//=================================


//------------------------------------------------
struct VC_PARA
{
    Uint16 vcSpdLoopKp1;            // F2-00  ЫйЖШЛЗБШР§дівц1
    Uint16 vcSpdLoopTi1;            // F2-01  ЫйЖШЛЗЛ§ЗжЪБМф1
    Uint16 vcSpdLoopChgFrq1;        // F2-02  ЧаЛЛЦЕТЪ1
    Uint16 vcSpdLoopKp2;            // F2-03  ЫйЖШЛЗБШР§дівц2
    Uint16 vcSpdLoopTi2;            // F2-04  ЫйЖШЛЗЛ§ЗжЪБМф2
    
    Uint16 vcSpdLoopChgFrq2;        // F2-05  ЧаЛЛЦЕТЪ2
    Uint16 vcSlipCompCoef;          // F2-06  зЊВюВЙГЅЯЕЪ§
    Uint16 vcSpdLoopFilterTime;     // F2-07  ЫйЖШЛЗТЫВЈЪБМфГЃЪ§
    Uint16 vcOverMagGain;           // F2-08  ЪИСППижЦЙ§РјДХдівц
    Uint16 spdCtrlDriveTorqueLimitSrc;  // F2-09  ЫйЖШПижЦ(Ч§ЖЏ)зЊОиЩЯЯодД
    
    Uint16 spdCtrlDriveTorqueLimit;     // F2-10  ЫйЖШПижЦ(Ч§ЖЏ)зЊОиЩЯЯоЪ§зжЩшЖЈ
    Uint16 spdCtrlBrakeTorqueLimitSrc;  // F2-11  ЫйЖШПижЦ(жЦЖЏ)зЊОиЩЯЯодД
    Uint16 spdCtrlBrakeTorqueLimit;     // F2-12  ЫйЖШПижЦ(жЦЖЏ)зЊОиЩЯЯоЪ§зжЩшЖЈ
    Uint16 mAcrKp;                  // F2-13  MжсЕчСїЛЗKp
    Uint16 mAcrKi;                  // F2-14  MжсЕчСїЛЗKi
    
    Uint16 tAcrKp;                  // F2-15  TжсЕчСїЛЗKp
    Uint16 tAcrKi;                  // F2-16  TжсЕчСїЛЗKi
    Uint16 spdLoopI;                // F2-17  ЫйЖШЛЗЛ§ЗжЪєад

    Uint16 weakFlusMode;            // F2-18 ЭЌВНЛњШѕДХФЃЪН
    Uint16 weakFlusCoef;            // F2-19 ЭЌВНЛњШѕДХЯЕЪ§
    Uint16 weakFlusCurMax;          // F2-20 зюДѓШѕДХЕчСї
    Uint16 weakFlusAutoCoef;        // F2-21 ШѕДХздЖЏЕїаГЯЕЪ§
    Uint16 weakFlusIntegrMul;       // F2-22 ШѕДХЛ§ЗжБЖЪ§
};
//------------------------------------------------



//------------------------------------------------
// Ек2ЕчЛњЕФЙІФмТыЃЌАќРЈЕчЛњВЮЪ§ЁЂПижЦВЮЪ§
struct MOTOR_FC
{
    union MOTOR_PARA motorPara;     // Ax-00  Ax-26 Ек2/3/4ЕчЛњВЮЪ§. ЭЌЕк1ЕчЛњВЮЪ§
    union PG_PARA    pgPara;        // Ax-27  Ax-36 Ек1ЕчЛњPGПЈВЮЪ§
    Uint16 tuneCmd;                 // Ax-37  ЕїаГУќСю
    struct VC_PARA vcPara;          // Ax-38  Ax-60
    
    Uint16 motorCtrlMode;           // Ax-61  Ек2/3/4ЕчЛњПижЦЗНЪН
    Uint16 accDecTimeMotor;         // Ax-62  Ек2/3/4ЕчЛњМгМѕЫйЪБМфбЁдё
    Uint16 torqueBoost;             // Ax-63  зЊОиЬсЩ§
    Uint16 rsvdA21;                 // Ax-64  еёЕДвжжЦдівцФЃЪН/
    Uint16 antiVibrateGain;         // Ax-65  еёЕДвжжЦдівц
};
//------------------------------------------------/





#define AI_NUMBER               3           // AIЖЫзгИіЪ§

#define AO_NUMBER               2           // AOЖЫзгИіЪ§

#define HDI_NUMBER              1           // HDIЖЫзгИіЪ§

#define HDO_NUMBER              1           // HDOЖЫзгИіЪ§

#define DI_NUMBER_PHSIC         10          // ЮяРэDIЖЫзг
#define DI_NUMBER_V             5           // ащФтDIЖЫзг
#define DI_NUMBER_AI_AS_DI      AI_NUMBER   // AIзїЮЊDI

#define DO_NUMBER_PHSIC         5           // ЮяРэDOЖЫзг
#define DO_NUMBER_V             5           // ащФтDOЖЫзг

#define PLC_STEP_MAX            16          // PLCЁЂЖрЖЮжИСюЖЮЪ§




//=====================================================================
// EEPROMЕФЪЙгУГЄЖШЃЌАќРЈжаМфдЄСєВПЗж
// EEPROMЕижЗЗжХфЃЌ2010-08-13
// 0            -   БЃСєЃЌrsvd4All
// 1,2          -   EEPROM-CHK
// 3            -   AIAO CHK
// 4-944        -   MD380ЪЙгУ
// 945-1149     -   дЄСєMD380ЪЙгУ
// 1150-1329    -   IS380/MD380MЪЙгУ
// Цфжа,16-63   -   ЕєЕчМЧвфЪЙгУ
#define EEPROM_INDEX_USE_LENGTH     994     // зюКѓвЛИіeepromЕижЗ+1
#define EEPROM_INDEX_USE_INDEX        4     // ЙІФмВЮЪ§ЪЙгУEEPROMЦ№ЪМ
// дЄСєИјЦфЫќЪЙгУЕФЙІФмТыindex
#define FUNCCODE_RSVD4ALL_INDEX     GetCodeIndex(funcCode.code.rsvd4All)


#define REM_P_OFF_MOTOR     5   // адФмЪЙгУЕФЕєЕчМЧвфЁЃАќКЌдкCORE_TO_FUNC_DISP_DATA_NUMРяУц


// ЙІФмТыЕФзщЪ§
#define FUNCCODE_GROUP_NUM  83  // АќРЈдЄСєЕФзщ, МћfuncCodeGradeCurrentMenuMode. 
// EEPROMжаЫГађ: EEPROM_CHK, ЕєЕчМЧвф, FF, FP, F0-FE, A0-AF, B0-BF, C0-CF
// ЯдЪОЫГађ:     F0-FE, FF, FP, A0-AF, B0-BF, C0-CF, EEPROM_CHK(ВЛЯдЪО), ЕєЕчМЧвф(ВЛЯдЪО), U0-UF
// U0-UFВЛеМгУEEPROMПеМф

#define FUNCCODE_GROUP_F0   0       // F0зщ
#define FUNCCODE_GROUP_F1   1       // F1зщ
#define FUNCCODE_GROUP_FE   14      // FFзщ
#define FUNCCODE_GROUP_FF   15      // FFзщ
#define FUNCCODE_GROUP_FP   16      // FPзщ
#define FUNCCODE_GROUP_A0   17      // A0зщ
#define FUNCCODE_GROUP_A5   22      // A5зщ
#define FUNCCODE_GROUP_AA   27      // AAзщ
#define FUNCCODE_GROUP_AB   28      // ABзщ
#define FUNCCODE_GROUP_AE   31      // AEзщ
#define FUNCCODE_GROUP_AF   32      // AFзщ
#define FUNCCODE_GROUP_B0   33      // B0зщ
#define FUNCCODE_GROUP_BF   48      // BFзщ
#define FUNCCODE_GROUP_C0   49      // C0зщ
//#define FUNCCODE_GROUP_CC   61      // CCзщ гУЛЇЖЈжЦЙІФмТызщ
#define FUNCCODE_GROUP_CF   64      // CFзщ
#define FUNCCODE_GROUP_U0   67      // U0зщЃЌЯдЪО
#define FUNCCODE_GROUP_U3   70      // U3зщЃЌЯдЪО
#define FUNCCODE_GROUP_UF   (FUNCCODE_GROUP_NUM - 1)    // UFЃЌадФмЕїЪдЯдЪО

// УПзщЙІФмТыЕФИіЪ§
// Г§FFзщжЎЭтЃЌУПзщдЄСє2ИіЙІФмТыЁЃЮЊСЫдкдіМгЙІФмТыЪБЃЌОЁСПВЛгУЛжИДГіГЇВЮЪ§ЁЃ
#define F0NUM           (28+ 1  )   // F0  ЛљБОЙІФмзщ
#define F1NUM           (38+ 0  )   // F1  ЕчЛњВЮЪ§
#define F2NUM           (23+ 0  )   // F2  ЪИСППижЦВЮЪ§
#define F3NUM           (16+ 0  )   // F3  V/FПижЦВЮЪ§

#define F4NUM           (40+ 0  )   // F4  ЪфШыЖЫзг
#define F5NUM           (23+ 0  )   // F5  ЪфГіЖЫзг
#define F6NUM           (16+ 0  )   // F6  ЦєЭЃПижЦ
#define F7NUM           (15+ 0  )   // F7  МќХЬгыЯдЪО

#define F8NUM           (54+ 0  )   // F8  ИЈжњЙІФм
#define F9NUM           (71+ 0  )   // F9  ЙЪеЯгыБЃЛЄ
#define FANUM           (29+ 0  )   // FA  PIDЙІФм 
#define FBNUM           (10+ 0  )   // FB  АкЦЕЁЂЖЈГЄКЭМЦЪ§

#define FCNUM           (52+ 0  )   // FC  ЖрЖЫЫйЁЂPLC
#define FDNUM           ( 8+ 0  )   // FD  ЭЈбЖВЮЪ§
#define FENUM           (32+ 0  )   // FE  280га320УЛгаЕФЙІФмТы
#define FFNUM           (13+ 0  )   // FF  ГЇМвВЮЪ§

#define FPNUM           ( 6+ 0  )   // FP  гУЛЇУмТы, ВЮЪ§ГѕЪМЛЏ

#define A0NUM           ( 9+ 0  )   // A0
#define A1NUM           (22+0   )   // A1
#define A2NUM           (F1NUM+2+F2NUM+3) // A2
#define A3NUM           (A2NUM)             // A3
#define A4NUM           (A2NUM)             // A4
#define A5NUM           (10+ 0  )   // A5
#define A6NUM           (30+0   )   // A6
#define A7NUM           (9+3    )   // A7
#define A8NUM           (8+0    )   // A8
#define A9NUM           (30     )   // A9
#define AANUM           (1+ 0  )    // AA
#define ABNUM           (1+ 0   )   // AB
#define ACNUM           (20     )   // AC
#define ADNUM           (1+0    )   // AD
#define AENUM           (ACNUM  )   // AE
#define AFNUM           ( 1+0   )   // AF

#define B0NUM           ( 0+1   )   // B0
#define B1NUM           ( 0+1   )   // B1
#define B2NUM           ( 0+1   )   // B2
#define B3NUM           ( 0+1   )   // B3
                                    
#define B4NUM           ( 0+1   )   // B4
#define B5NUM           ( 0+1   )   // B5
#define B6NUM           ( 0+1   )   // B6
#define B7NUM           ( 0+1   )   // B7
                                    
#define B8NUM           ( 0+1   )   // B8
#define B9NUM           ( 0+1   )   // B9
#define BANUM           ( 0+1   )   // BA
#define BBNUM           ( 0+1   )   // BB
                                    
#define BCNUM           ( 0+1   )   // BC
#define BDNUM           ( 0+1   )   // BD
#define BENUM           ( 0+1   )   // BE
#define BFNUM           ( 0+1   )   // BF

#define C0NUM           ( 0+1   )   // C0
#define C1NUM           ( 0+1   )   // C1
#define C2NUM           ( 0+1)      // C2
#define C3NUM           ( 0+1)      // C3

#define C4NUM           ( 0+1)      // C4
#define C5NUM           ( 0+1)      // C5
#define C6NUM           ( 0+1)      // C6
#define C7NUM           ( 0+1)      // C7

#define C8NUM           ( 0+1)      // C8
#define C9NUM           ( 0+1)      // C9
#define CANUM           ( 0+1)      // CA
#define CBNUM           ( 0+1)      // CB
                                
#define CCNUM           ( 1+0)      // CC   
#define CDNUM           ( 0+1)      // CD
#define CENUM           ( 0+1)      // CE
#if DEBUG_F_MOTOR_FUNCCODE
#define CFNUM           FUNC_TO_CORE_DEBUG_DATA_NUM     // CF  ЕїЪдЃЌfunc2motor
#elif 1
#define CFNUM           ( 0+1)      // CF
#endif

#define CHK_NUM   (4 +0  )  //     eepromCheckWord(2)ЃЌrsvd4All(1)ЗХдкетРяЕФзюЧАУц, AIAOChk(1)вВдкетРя
#define REM_NUM   (48)      // ЕєЕчМЧвфЃЌАќРЈадФмЪЙгУЕФЕєЕчМЧвфЁЃ(АќРЈадФмЕФЕєЕчМЧвф)

#define U0NUM     (100+0)   // U0  ЯдЪОЪЙгУЃЌВЛеМгУEEPROMЃЌОЁСПЩйЕФеМгУГЬађПеМф(ЮоГіГЇжЕЁЂЩЯЯТЯоЃЌЕЋгаЪєад)
#define U1NUM     ( 0+1)    // U1
#define U2NUM     ( 0+1)    // U2
#define U3NUM     (10+2)    // U3

#define U4NUM     ( 0+1)    // U4
#define U5NUM     ( 0+1)    // U5
#define U6NUM     ( 0+1)    // U6
#define U7NUM     ( 0+1)    // U7

#define U8NUM     ( 0+1)    // U8
#define U9NUM     ( 0+1)    // U9
#define UANUM     ( 0+1)    // UA
#define UBNUM     ( 0+1)    // UB

#define UCNUM     ( 0+1)    // UC
#define UDNUM     ( 0+1)    // UD
#define UENUM     ( 0+1)    // UE
#if DEBUG_F_MOTOR_FUNCCODE
#define UFNUM     CORE_TO_FUNC_DISP_DATA_NUM  // UF  ЕїЪдЃЌmotor2func
#elif 1
#define UFNUM     ( 0+1)    // UF адФмЕїЪдЪЙгУ
#endif

#define FNUM_PARA      (F0NUM + F1NUM + F2NUM + F3NUM +     \
                        F4NUM + F5NUM + F6NUM + F7NUM +     \
                        F8NUM + F9NUM + FANUM + FBNUM +     \
                        FCNUM + FDNUM + FENUM + FFNUM +     \
                                                            \
                        FPNUM +                             \
                                                            \
                        A0NUM + A1NUM + A2NUM + A3NUM +     \
                        A4NUM + A5NUM + A6NUM + A7NUM +     \
                        A8NUM + A9NUM + AANUM + ABNUM +     \
                        ACNUM + ADNUM + AENUM + AFNUM +     \
                                                            \
                        B0NUM + B1NUM + B2NUM + B3NUM +     \
                        B4NUM + B5NUM + B6NUM + B7NUM +     \
                        B8NUM + B9NUM + BANUM + BBNUM +     \
                        BCNUM + BDNUM + BENUM + BFNUM +     \
                                                            \
                        C0NUM + C1NUM + C2NUM + C3NUM +     \
                        C4NUM + C5NUM + C6NUM + C7NUM +     \
                        C8NUM + C9NUM + CANUM + CBNUM +     \
                        CCNUM + CDNUM + CENUM + CFNUM       \
                        )                                   // ЫљгаЙІФмТыЃЌВЛАќРЈЯдЪО
#define FNUM_EEPROM    (FNUM_PARA + CHK_NUM + REM_NUM)      // ашвЊДцДЂдкEEPROMжаЕФЫљгаВЮЪ§
#define FNUM_ALL       (FNUM_EEPROM +                       \
                        U0NUM + U1NUM + U2NUM + U3NUM +     \
                        U4NUM + U5NUM + U6NUM + U7NUM +     \
                        U8NUM + U9NUM + UANUM + UBNUM +     \
                        UCNUM + UDNUM + UENUM + UFNUM       \
                       )                                    // ЫљгаЙІФмТыЁЂВЮЪ§ЃЌАќРЈЯдЪО


//=====================================================================
//
// ЙІФмТызщЃЌF0зщЃЌF1зщ, ...
//
// eepromCheckWordЗХдкзюЧАУц
// ГЇМвВЮЪ§ЁЂгУЛЇУмТыЁЂгУЛЇЖЈжЦВЫЕЅЗХдкЧАУцЃЌЗРжЙдіЩОЙІФмТыЪББЛЮѓаоИФЁЃ
// fcгыeepromгаЖдгІЙиЯЕБэЃЌЫљвдвдЩЯвЊЧѓВЛашвЊСЫ
//
//=====================================================================
struct FUNCCODE_GROUP 
{
//======================================
    Uint16 f0[F0NUM];               // F0 ЛљБОЙІФмзщ
    Uint16 f1[F1NUM];               // F1 ЕчЛњВЮЪ§
    Uint16 f2[F2NUM];               // F2 ЪИСППижЦВЮЪ§
    Uint16 f3[F3NUM];               // F3 V/FПижЦВЮЪ§
    
//======================================
    Uint16 f4[F4NUM];               // F4 ЪфШыЖЫзг
    Uint16 f5[F5NUM];               // F5 ЪфГіЖЫзг
    Uint16 f6[F6NUM];               // F6 ЦєЭЃПижЦ
    Uint16 f7[F7NUM];               // F7 МќХЬгыЯдЪО
    
//======================================
    Uint16 f8[F8NUM];               // F8 ИЈжњЙІФм
    Uint16 f9[F9NUM];               // F9 ЙЪеЯгыБЃЛЄ
    Uint16 fa[FANUM];               // FA PIDЙІФм
    Uint16 fb[FBNUM];               // FB АкЦЕЁЂЖЈГЄКЭМЦЪ§

//======================================
    Uint16 fc[FCNUM];               // FC ЖрЖЫЫйЁЂPLC
    Uint16 fd[FDNUM];               // FD ЭЈбЖВЮЪ§
    Uint16 fe[FENUM];               // FE 280га320УЛгаЕФЙІФмТы
    Uint16 ff[FFNUM];               // FF ГЇМвВЮЪ§
    
//======================================
    Uint16 fp[FPNUM];               // FP ЙІФмТыЙмРэ
    
//======================================
    Uint16 a0[A0NUM];               // A0
    Uint16 a1[A1NUM];               // A1
    Uint16 a2[A2NUM];               // A2
    Uint16 a3[A3NUM];               // A3

//======================================
    Uint16 a4[A4NUM];               // A4
    Uint16 a5[A5NUM];               // A5
    Uint16 a6[A6NUM];               // A6
    Uint16 a7[A7NUM];               // A7

//======================================
    Uint16 a8[A8NUM];               // A8
    Uint16 a9[A9NUM];               // A9
    Uint16 aa[AANUM];               // AA
    Uint16 ab[ABNUM];               // AB

//======================================
    Uint16 ac[ACNUM];               // AC
    Uint16 ad[ADNUM];               // AD
    Uint16 ae[AENUM];               // AE AIAOГіГЇаЃе§
    Uint16 af[AFNUM];               // AF ЙІФмТызщвўВи
    
//======================================
    Uint16 b0[B0NUM];               // B0
    Uint16 b1[B1NUM];               // B1
    Uint16 b2[B2NUM];               // B2
    Uint16 b3[B3NUM];               // B3

//======================================
    Uint16 b4[B4NUM];               // B4
    Uint16 b5[B5NUM];               // B5
    Uint16 b6[B6NUM];               // B6
    Uint16 b7[B7NUM];               // B7

//======================================
    Uint16 b8[B8NUM];               // B8
    Uint16 b9[B9NUM];               // B9
    Uint16 ba[BANUM];               // BA
    Uint16 bb[BBNUM];               // BB

//======================================
    Uint16 bc[BCNUM];               // BC
    Uint16 bd[BDNUM];               // BD
    Uint16 be[BENUM];               // BE
    Uint16 bf[BFNUM];               // BF

//======================================
    Uint16 c0[C0NUM];               // C0
    Uint16 c1[C1NUM];               // C1
    Uint16 c2[C2NUM];               // C2
    Uint16 c3[C3NUM];               // C3

//======================================
    Uint16 c4[C4NUM];               // C4
    Uint16 c5[C5NUM];               // C5
    Uint16 c6[C6NUM];               // C6
    Uint16 c7[C7NUM];               // C7

//======================================
    Uint16 c8[C8NUM];               // C8
    Uint16 c9[C9NUM];               // C9
    Uint16 ca[CANUM];               // CA
    Uint16 cb[CBNUM];               // CB

//======================================
    Uint16 cc[CCNUM];               // CC   
    Uint16 cd[CDNUM];               // CD
    Uint16 ce[CENUM];               // CE
    Uint16 cf[CFNUM];               // CF

// жЎЧАЕФЙІФмТыгаЩЯЯТЯоЃЌЪєадЃЛжЎКѓУЛгаЃЌНкЪЁПеМф
//======================================

//======================================
    Uint16 fChk[CHK_NUM];           // eepromCheckWord

//======================================
    Uint16 remember[REM_NUM];       // ЕєЕчМЧвф

// жЎЧАЕФЪ§ОнвЊЗХдкEEPROMжа
//======================================

//======================================
// жЎКѓЕФЪ§ОнВЛашвЊЗХдкEEPROMжаЃЌНіRAM
    Uint16 u0[U0NUM];               // U0 ЯдЪО
    Uint16 u1[U1NUM];               // U1
    Uint16 u2[U2NUM];               // U2
    Uint16 u3[U3NUM];               // U3

//======================================
    Uint16 u4[U4NUM];               // U4
    Uint16 u5[U5NUM];               // U5
    Uint16 u6[U6NUM];               // U6
    Uint16 u7[U7NUM];               // U7

//======================================
    Uint16 u8[U8NUM];               // U8
    Uint16 u9[U9NUM];               // U9
    Uint16 ua[UANUM];               // UA
    Uint16 ub[UBNUM];               // UB

//======================================
    Uint16 uc[UCNUM];               // UC
    Uint16 ud[UDNUM];               // UD
    Uint16 ue[UENUM];               // UE
    Uint16 uf[UFNUM];               // UF, ЯдЪОЃЌадФмЕїЪдЪЙгУ
//======================================
};


//=====================================================================
//
// ЙІФмТыЃЌF0-00, F0-01, ..., F1-00, F1-01, ...
//
//=====================================================================
struct FUNCCODE_CODE 
{
//======================================
// F0 ЛљБОЙІФмзщ
    Uint16 inverterGpTypeDisp;      // F0-00  GPРраЭЯдЪО
    Uint16 motorCtrlMode;           // F0-01  (ЕчЛњ)ПижЦЗНЪН
    Uint16 runSrc;                  // F0-02  УќСюдДбЁдё
    Uint16 frqXSrc;                 // F0-03  жїЦЕТЪдДXбЁдё
    Uint16 frqYSrc;                 // F0-04  ИЈжњЦЕТЪдДYбЁдё
    Uint16 frqYRangeBase;           // F0-05  ИЈжњЦЕТЪдДYЗЖЮЇбЁдё
    Uint16 frqYRange;               // F0-06  ИЈжњЦЕТЪдДYЗЖЮЇ
    Uint16 frqCalcSrc;              // F0-07  ЦЕТЪдДбЁдё
    Uint16 presetFrq;               // F0-08  дЄжУЦЕТЪ
    Uint16 runDir;                  // F0-09  дЫааЗНЯђ
    Uint16 maxFrq;                  // F0-10  зюДѓЦЕТЪ
    Uint16 upperFrqSrc;             // F0-11  ЩЯЯоЦЕТЪдД
    Uint16 upperFrq;                // F0-12  ЩЯЯоЦЕТЪЪ§жЕЩшЖЈ
    Uint16 upperFrqOffset;          // F0-13  ЩЯЯоЦЕТЪЦЋжУ
    Uint16 lowerFrq;                // F0-14  ЯТЯоЦЕТЪЪ§жЕЩшЖЈ
    Uint16 carrierFrq;              // F0-15  диВЈЦЕТЪ
    Uint16 varFcByTem;              // F0-16  диВЈЦЕТЪЫцЮТЖШЕїећ
    Uint16 accTime1;                // F0-17  МгЫйЪБМф1
    Uint16 decTime1;                // F0-18  МѕЫйЪБМф1
    Uint16 accDecTimeUnit;          // F0-19  МгМѕЫйЪБМфЕФЕЅЮЛ
    Uint16 frqYOffsetSrc;           // F0-20  ИЈжњЦЕТЪдДЦЋжУбЁдё
    Uint16 frqYOffsetFc;            // F0-21  ИЈжњЦЕТЪдДЦЋжУЕФЪ§зжЩшЖЈ
    Uint16 frqPoint;                // F0-22  ЦЕТЪжИСюаЁЪ§Еу
    Uint16 frqRemMode;              // F0-23  Ъ§зжЩшЖЈЦЕТЪМЧвфбЁдё
    enum MOTOR_SN motorSn;          // F0-24  ЕчЛњбЁдё
    Uint16 accDecBenchmark;         // F0-25  МгМѕЫйЪБМфЛљзМЦЕТЪ
    Uint16 updnBenchmark;           // F0-26  дЫааЪБЦЕТЪжИСюUP/DOWNЛљзМ
    Uint16 frqRunCmdBind;           // F0-27  УќСюдДРІАѓЦЕТЪдД
    Uint16 commProtocolSec;         // F0-28  ЭЈбЖа­вщбЁдё

//======================================
// F1 ЕчЛњВЮЪ§
    union MOTOR_PARA motorParaM1;   // F1-00  F1-26 Ек1ЕчЛњВЮЪ§
    union PG_PARA    pgParaM1;      // f1-27  F1-36 Ек1ЕчЛњPGПЈВЮЪ§
    Uint16 tuneCmd;                 // F1-37  ЕїаГбЁдё

//======================================
// F2 ЪИСППижЦВЮЪ§
    struct VC_PARA vcParaM1;        // Ек1ЕчЛњЪИСППижЦВЮЪ§


//======================================
// F3 V/FПижЦВЮЪ§
    Uint16 vfCurve;                 // F3-00  VFЧњЯпЩшЖЈ
    Uint16 torqueBoost;             // F3-01  зЊОиЬсЩ§
    Uint16 boostCloseFrq;           // F3-02  зЊОиЬсЩ§НижЙЦЕТЪ
    Uint16 vfFrq1;                  // F3-03  ЖрЕуVFЦЕТЪЕу1
    Uint16 vfVol1;                  // F3-04  ЖрЕуVFЕчбЙЕу1
    Uint16 vfFrq2;                  // F3-05  ЖрЕуVFЦЕТЪЕу2
    Uint16 vfVol2;                  // F3-06  ЖрЕуVFЕчбЙЕу2
    Uint16 vfFrq3;                  // F3-07  ЖрЕуVFЦЕТЪЕу3
    Uint16 vfVol3;                  // F3-08  ЖрЕуVFЕчбЙЕу3
    Uint16 slipCompCoef;            // F3-09  зЊВюВЙГЅЯЕЪ§
    Uint16 vfOverMagGain;           // F3-10  VFЙ§РјДХдівц
    Uint16 antiVibrateGain;         // F3-11  еёЕДвжжЦдівц

    Uint16 rsvdF31;//antiVibrateGainMode;     // F3-12  еёЕДвжжЦдівцФЃЪН
    Uint16 vfVoltageSrc;            // F3-13  VFЗжРыЕФЕчбЙдД
    Uint16 vfVoltageDigtalSet;      // F3-14  VFЗжРыЕФЕчбЙдДЪ§зжЩшЖЈ
    Uint16 vfVoltageAccTime;        // F3-15  VFЗжРыЕФЕчбЙЩЯЩ§ЪБМф

//======================================
// F4 ЪфШыЖЫзг
    Uint16 diFunc[DI_NUMBER_PHSIC]; // F4-00  --F4-09   DI1ЖЫзгЙІФмбЁдё
    
    Uint16 diFilterTime;            // F4-10  DIТЫВЈЪБМф
    Uint16 diControlMode;           // F4-11  ЖЫзгУќСюЗНЪН
    Uint16 diUpDownSlope;           // F4-12  ЖЫзгUP/DOWNЫйТЪЃЌИФЮЊ0.001Hz

    Uint16 curveSet2P1[4];          // F4-13,...,F4-16  ЧњЯп1ЃЌ2ЕуЃЌзюДѓжЕЃЌзюаЁжЕ
    Uint16 ai1FilterTime;           // F4-17  AI1ТЫВЈЪБМф, 10ms

    Uint16 curveSet2P2[4];          // F4-18,...,F4-21  ЧњЯп2ЃЌ2Еу
    Uint16 ai2FilterTime;           // F4-22  AI2ТЫВЈЪБМф, 10ms

    Uint16 curveSet2P3[4];          // F4-23,...,F4-26  ЧњЯп3ЃЌ2Еу
    Uint16 ai3FilterTime;           // F4-27  AI3ТЫВЈЪБМф, 10ms

    Uint16 curveSet2P4[4];          // F4-28,...,F4-31  HDIЧњЯпЃЌ2Еу
    Uint16 pulseInFilterTime;       // F4-32  PULSEТЫВЈЪБМф, 10ms

    Uint16 aiCurveSrc;              // F4-33  AIЩшЖЈЧњЯпбЁдё

    Uint16 aiLimitSrc;              // F4-34  AIЯТЯобЁдё

    Uint16 diDelayTime[3];          // F4-35  DI1бгГйЪБМф
    Uint16 diLogic[2];              // F4-38  DIгааЇзДЬЌбЁдё1
                                    // F4-39  DIгааЇзДЬЌбЁдё2

//======================================
// F5 ЪфГіЖЫзг
    Uint16 fmOutSelect;             // F5-00  ЖрЙІФмЖЫзгЪфГібЁдё
    Uint16 doFunc[DO_NUMBER_PHSIC]; // F5-01  FMRЪфГібЁдё
                                    // F5-02  ПижЦАхRELAYЪфГібЁдё
                                    // F5-03  РЉеЙПЈRELAYЪфГібЁдё
                                    // F5-04  DO1ЪфГібЁдё
                                    // F5-05  РЉеЙПЈDO2ЪфГібЁдё

    Uint16 aoFunc[AO_NUMBER+HDO_NUMBER];    // F5-06  FMPЪфГібЁдё
                                            // F5-07  AO1ЪфГібЁдё
                                            // F5-08  РЉеЙПЈAO2ЪфГібЁдё
    Uint16 fmpOutMaxFrq;                    // F5-09  FMPЪфГізюДѓЦЕТЪ

    AO_PARA aoPara[AO_NUMBER];              // F5-10  AO1СуЦЋЯЕЪ§
                                            // F5-11  AO1дівц
                                            // F5-12  AO2СуЦЋЯЕЪ§
                                            // F5-13  AO2дівц
    Uint16 aoLpfTime[AO_NUMBER+HDO_NUMBER]; // F5-14  HDO,AO1,AO2ЪфГіТЫВЈЪБМф
    
    Uint16 doDelayTime[DO_NUMBER_PHSIC];// F5-17  RELAY1ЪфГібгГйЪБМф
                                        // F5-18  RELAY2ЪфГібгГйЪБМф
                                        // F5-19  DO1ЪфГібгГйЪБМф
                                    
                                        // F5-20  DO2ЪфГібгГйЪБМф
                                        // F5-21  DO3ЪфГібгГйЪБМф
    Uint16 doLogic;                     // F5-22  DOгааЇзДЬЌбЁдё

//======================================
// F6 ЦєЭЃПижЦ
    Uint16 startMode;               // F6-00  ЦєЖЏЗНЪН
    Uint16 speedTrackMode;          // F6-01  зЊЫйИњзйЗНЪН
    Uint16 speedTrackVelocity;      // F6-02  зЊЫйИњзйПьТ§
    Uint16 startFrq;                // F6-03  ЦєЖЏЦЕТЪ
    Uint16 startFrqTime;            // F6-04  ЦєЖЏЦЕТЪБЃГжЪБМф
    Uint16 startBrakeCurrent;       // F6-05  ЦєЖЏжБСїжЦЖЏЕчСї
    Uint16 startBrakeTime;          // F6-06  ЦєЖЏжБСїжЦЖЏЪБМф
    Uint16 accDecSpdCurve;          // F6-07  МгМѕЫйЗНЪН
    Uint16 sCurveStartPhaseTime;    // F6-08  SЧњЯпПЊЪМЖЮЪБМфБШР§
    Uint16 sCurveEndPhaseTime;      // F6-09  SЧњЯпНсЪјЖЮЪБМфБШР§
    Uint16 stopMode;                // F6-10  ЭЃЛњЗНЪН
    Uint16 stopBrakeFrq;            // F6-11  ЭЃЛњжБСїжЦЖЏЦ№ЪМЦЕТЪ
    Uint16 stopBrakeWaitTime;       // F6-12  ЭЃЛњжБСїжЦЖЏЕШД§ЪБМф
    Uint16 stopBrakeCurrent;        // F6-13  ЭЃЛњжБСїжЦЖЏЕчСї
    Uint16 stopBrakeTime;           // F6-14  ЭЃЛњжБСїжЦЖЏЪБМф
    Uint16 brakeDutyRatio;          // F6-15  жЦЖЏЪЙгУТЪ

//======================================
// F7 МќХЬгыЯдЪО
    Uint16 rsvdF71;                 // F7-00  БЃСє
    Uint16 mfkKeyFunc;              // F7-01  MF.KМќЙІФмбЁдё
    Uint16 stopKeyFunc;             // F7-02  STOPМќЙІФм
    Uint16 ledDispParaRun1;         // F7-03  LEDдЫааЯдЪОВЮЪ§1
    Uint16 ledDispParaRun2;         // F7-04  LEDдЫааЯдЪОВЮЪ§2
    
    Uint16 ledDispParaStop;         // F7-05  LEDЭЃЛњЯдЪОВЮЪ§
    Uint16 speedDispCoeff;          // F7-06  ИКдиЫйЖШЯдЪОЯЕЪ§
    Uint16 radiatorTemp;            // F7-07  ФцБфЦїФЃПщЩЂШШЦїЮТЖШ
    Uint16 temp2;                   // F7-08  ећСїЧХЩЂШШЦїЮТЖШ
    Uint16 runTimeAddup;            // F7-09  РлМЦдЫааЪБМф, ЕЅЮЛ: h
    
    Uint16 productVersion;          // F7-10  ВњЦЗКХ
    Uint16 softVersion;             // F7-11  ШэМўАцБОКХ
    Uint16 speedDispPointPos;       // F7-12  ИКдиЫйЖШЯдЪОаЁЪ§ЕуЮЛжУ
    Uint16 powerUpTimeAddup;        // F7-13  РлМЦЩЯЕчЪБМф
    Uint16 powerAddup;              // F7-14  РлМЦКФЕчСП
    

//======================================
// F8 ИЈжњЙІФм
    Uint16 jogFrq;                  // F8-00  ЕуЖЏдЫааЦЕТЪ
    Uint16 jogAccTime;              // F8-01  ЕуЖЏМгЫйЪБМф
    Uint16 jogDecTime;              // F8-02  ЕуЖЏМѕЫйЪБМф
    Uint16 accTime2;                // F8-03  МгЫйЪБМф2
    Uint16 decTime2;                // F8-04  МѕЫйЪБМф2
    Uint16 accTime3;                // F8-05  МгЫйЪБМф3
    Uint16 decTime3;                // F8-06  МѕЫйЪБМф3
    Uint16 accTime4;                // F8-07  МгЫйЪБМф4
    Uint16 decTime4;                // F8-08  МѕЫйЪБМф4
    Uint16 jumpFrq1;                // F8-09  ЬјдОЦЕТЪ1
    Uint16 jumpFrq2;                // F8-10  ЬјдОЦЕТЪ2
    Uint16 jumpFrqRange;            // F8-11  ЬјдОЦЕТЪЗљЖШ
    Uint16 zeroSpeedDeadTime;       // F8-12  е§ЗДзЊЫРЧјЪБМф
    Uint16 antiReverseRun;          // F8-13  ЗДзЊПижЦ, 0-дЪаэЗДзЊЃЌ1-НћжЙЗДзЊ
    Uint16 lowerDeal;               // F8-14  ЦЕТЪЕЭгкЯТЯоЦЕТЪдЫааЖЏзї
    Uint16 droopCtrl;               // F8-15  ЯТДЙПижЦ
    Uint16 powerUpTimeArriveSet;    // F8-16  ЩшЖЈЩЯЕчЕНДяЪБМф
    Uint16 runTimeArriveSet;        // F8-17  ЩшЖЈдЫааЕНДяЪБМф
    Uint16 startProtect;            // F8-18  ЦєЖЏБЃЛЄбЁдё
    Uint16 frqFdtValue;             // F8-19  ЦЕТЪМьВтжЕ(FDTЕчЦН)
    Uint16 frqFdtLag;               // F8-20  ЦЕТЪМьВтжЭКѓжЕ
    Uint16 frqArriveRange;          // F8-21  ЦЕТЪЕНДяМьГіЗљЖШ
    Uint16 jumpFrqMode;             // F8-22  МгМѕЫйЙ§ГЬжаЬјдОЦЕТЪЪЧЗёгааЇ
    Uint16 runTimeOverAct;          // F8-23  ЩшЖЈдЫааЪБМфЕНДяЖЏзїбЁдё
  
    // ADD
    Uint16 powerUpTimeOverAct;      // F8-24  ЩшЖЈЩЯЕчЪБМфЕНДяЖЏзїбЁдё
    Uint16 accTimefrqChgValue;      // F8-25  МгЫйЪБМф1/2ЧаЛЛЦЕТЪЕу 
    Uint16 decTimefrqChgValue;      // F8-26  МѕЫйЪБМф1/2ЧаЛЛЦЕТЪЕу 
    Uint16 jogWhenRun;              // F8-27  ЖЫзгЕуЖЏгХЯШ
    Uint16 frqFdt1Value;            // F8-28  ЦЕТЪМьВтжЕ(FDT1ЕчЦН)
    Uint16 frqFdt1Lag;              // F8-29  ЦЕТЪМьВт1жЭКѓжЕ
    Uint16 frqArriveValue1;         // F8-30  ЦЕТЪЕНДяМьВтжЕ1 
    Uint16 frqArriveRange1;         // F8-31  ЦЕТЪЕНДяМьГі1ЗљЖШ
    Uint16 frqArriveValue2;         // F8-32  ЦЕТЪЕНДяМьВтжЕ2 
    Uint16 frqArriveRange2;         // F8-33  ЦЕТЪЕНДяМьГі2ЗљЖШ

    Uint16 oCurrentChkValue;        // F8-34  СуЕчСїМьВтжЕ
    Uint16 oCurrentChkTime;         // F8-35  СуЕчСїМьВтбгГйЪБМф
    Uint16 softOCValue;             // F8-36  ШэМўЙ§СїЕу
    Uint16 softOCDelay;             // F8-37  ШэМўЙ§СїМьВтбгГйЪБМф

    Uint16 currentArriveValue1;     // F8-38  ЕчСїЕНДяМьВтжЕ1
    Uint16 currentArriveRange1;     // F8-39  ЕчСїЕНДяМьВт1ЗљЖШ
    Uint16 currentArriveValue2;     // F8-40  ЕчСїЕНДяМьВтжЕ1
    Uint16 currentArriveRange2;     // F8-41  ЕчСїЕНДяМьВт1ЗљЖШ

    Uint16 setTimeMode;             // F8-42  ЖЈЪБЙІФмбЁдё
    Uint16 setTimeSource;           // F8-43  ЖЈЪБЪБМфЩшЖЈбЁдё
    Uint16 setTimeValue;            // F8-44  ЩшЖЈдЫааЪБМф
    
    Uint16 ai1VoltageLimit;         // F8-45  AI1ЪфШыЕчбЙЯТЯо
    Uint16 ai1VoltageUpper;         // F8-46  AI1ЪфШыЕчбЙЩЯЯо

    Uint16 temperatureArrive;       // F8-47  ФЃПщЮТЖШЕНДя
    Uint16 fanControl;              // F8-48  ЗчЩШПижЦ
    Uint16 wakeUpFrq;               // F8-49  ЛНабЦЕТЪ
    Uint16 wakeUpTime;              // F8-50  ЛНаббгГйЪБМф
    Uint16 dormantFrq;              // F8-51  анУпЦЕТЪ
    Uint16 dormantTime;             // F8-52  анУпбгГйЪБМф
    Uint16 setTimeArrive;           // F8-53  ЕБЧАдЫааЕНДяЪБМф
    
//======================================
// F9 ЙЪеЯгыБЃЛЄ
    Uint16 overloadMode;                // F9-00  ЕчЛњЙ§диБЃЛЄбЁдё
    Uint16 overloadGain;                // F9-01  ЕчЛњЙ§диБЃЛЄдівц
    Uint16 foreOverloadCoef;            // F9-02  ЕчЛњЙ§дидЄОЏЯЕЪ§
    Uint16 ovGain;                      // F9-03  Й§бЙЪЇЫйдівц
    Uint16 ovPoint;                     // F9-04  Й§бЙЪЇЫйБЃЛЄЕчбЙ
    
    Uint16 ocGain;                      // F9-05  Й§СїЪЇЫйдівц
    Uint16 ocPoint;                     // F9-06  Й§СїЪЇЫйБЃЛЄЕчСї
    Uint16 shortCheckMode;              // F9-07  ЩЯЕчЖдЕиЖЬТЗБЃЛЄЙІФм
    Uint16 rsvdF91;                     // F9-08  БЃСє
    Uint16 errAutoRstNumMax;            // F9-09  ЙЪеЯздЖЏИДЮЛДЮЪ§
    
    Uint16 errAutoRstRelayAct;          // F9-10  ЙЪеЯздЖЏИДЮЛЦкМфЙЪеЯМЬЕчЦїЖЏзїбЁдё
    Uint16 errAutoRstSpaceTime;         // F9-11  ЙЪеЯздЖЏИДЮЛМфИєЪБМф, 0.1s 
    Uint16 inPhaseLossProtect;          // F9-12  ЪфШыШБЯрБЃЛЄбЁдё
    Uint16 outPhaseLossProtect;         // F9-13  ЪфГіШБЯрБЃЛЄбЁдё
    Uint16 errorLatest1;                // F9-14  ЕквЛДЮЙЪеЯРраЭ
    
    Uint16 errorLatest2;                // F9-15  ЕкЖўДЮЙЪеЯРраЭ
    Uint16 errorLatest3;                // F9-16  ЕкШ§ДЮ(зюНќвЛДЮ)ЙЪеЯРраЭ

    union ERROR_SCENE errorScene3;      // F9-17  ЕкШ§ДЮ(зюНќвЛДЮ)ЙЪеЯЪБЦЕТЪ                              
                                        // F9-18  ЕкШ§ДЮ(зюНќвЛДЮ)ЙЪеЯЪБЕчСї                             
                                        // F9-19  ЕкШ§ДЮ(зюНќвЛДЮ)ЙЪеЯЪБФИЯпЕчбЙ                                                                                  
                                        // F9-20  ЕкШ§ДЮ(зюНќвЛДЮ)ЙЪеЯЪБЪфШыЖЫзгзДЬЌ                     
                                        // F9-21  ЕкШ§ДЮ(зюНќвЛДЮ)ЙЪеЯЪБЪфГіЖЫзгзДЬЌ   
                                        
                                        // F9-22  ЕкШ§ДЮ(зюНќвЛДЮ)ЙЪеЯЪББфЦЕЦїзДЬЌ                       
                                        // F9-23  ЕкШ§ДЮ(зюНќвЛДЮ)ЙЪеЯЪБЪБМфЃЈДгБОДЮЩЯЕчПЊЪММЦЪБЃЉ       
                                        // F9-24  ЕкШ§ДЮ(зюНќвЛДЮ)ЙЪеЯЪБЪБМфЃЈДгдЫааЪБПЊЪММЦЪБЃЉ         

    Uint16 rsvdF92[2];                  // F9-25  F9-26
    
    union ERROR_SCENE errorScene2;      // F9-27  ЕкЖўДЮЙЪеЯЯжГЁ
    Uint16 rsvdF921[2];                 // F9-35  F9-36

    union ERROR_SCENE errorScene1;      // F9-37  ЕквЛДЮЙЪеЯЯжГЁ
    Uint16 rsvdF922[2];                 // F9-45  F9-46
    
    Uint16 errorAction[5];              // F9-47  -F9-51  ЙЪеЯЪББЃЛЄЖЏзїбЁдё1-5
    Uint16 errorShow[2];                // F9-52  -F9-53  ЙЪеЯжИЪОбЁдё1,2
    Uint16 errorRunFrqSrc;              // F9-54  ЙЪеЯЪБМЬајдЫааЦЕТЪбЁдё
    Uint16 errorSecondFrq;              // F9-55  вьГЃБИгУЦЕТЪЩшЖЈ
    
    Uint16 motorOtMode;                 // F9-56  ЕчЛњЮТЖШДЋИаЦїРраЭ
    Uint16 motorOtProtect;              // F9-57  ЕчЛњЙ§ШШБЃЛЄуажЕ
    Uint16 motorOtCoef;                 // F9-58  ЕчЛњЙ§ШШдЄБЈОЏуажЕ
     
    Uint16 pOffTransitoryNoStop;        // F9-59  ЫВЭЃВЛЭЃЙІФмбЁдё
    Uint16 pOffTransitoryFrqDecSlope;   // F9-60  ЫВЭЃЖЏзїднЭЃХаЖЯЕчбЙ
    Uint16 pOffVolBackTime;             // F9-61  ЫВЭЃВЛЭЃЕчбЙЛиЩ§ХаЖЯЪБМф
    
    Uint16 pOffThresholdVol;            // F9-62  ЫВЭЃВЛЭЃЖЏзїХаЖЯЕчбЙ
    Uint16 loseLoadProtectMode;         // F9-63  ЕєдиБЃЛЄбЁдё
    Uint16 loseLoadLevel;               // F9-64  ЕєдиМьГіЫЎЦН
    Uint16 loseLoadTime;                // F9-65  ЕєдиМьГіЪБМф
    Uint16 rsvdF923;                    // F9-66  ЙЪеЯЦЕТЪЕФаЁЪ§Еу

    Uint16 osChkValue;                  // F9-67 Й§ЫйЖШМьВтжЕ
    Uint16 osChkTime;                   // F9-68 Й§ЫйЖШМьВтЪБМф
    Uint16 devChkValue;                 // F9-69 ЫйЖШЦЋВюЙ§ДѓМьВтжЕ
    Uint16 devChkTime;                  // F9-70 ЫйЖШЦЋВюЙ§ДѓМьВтЪБМф

#if 0 
    Uint16 losePowerStopEnable;         // F9-71 ЕєЕчЭЃЛњЙІФмгааЇ
    Uint16 losePowerStopSel;            // F9-72 ЕєЕчЭЃЛњДІРэЗНЪН
    Uint16 losePowerLowerFrq;           // F9-73 ЕєЕчГѕЪМЕјТфЦЕТЪ
    Uint16 losePowerLowerTime;          // F9-74 ЕєЕчГѕЪМЕјТфЪБМф
    Uint16 losePowerDectime;            // F9-75 ЕєЕчМѕЫйЪБМф
    Uint16 losePowerP;                  // F9-76 ЕєЕчЕјТфЕчбЙБеЛЗБШР§
    Uint16 losePowerI;                  // F9-77 ЕєЕчЕјТфЕчбЙБеЛЗЛ§Зж
    
#endif
    

//======================================
// FA PIDЙІФм
    Uint16 pidSetSrc;               // FA-00  PIDИјЖЈдД
    Uint16 pidSet;                  // FA-01  PIDЪ§жЕИјЖЈ, 0.1%
    Uint16 pidFdbSrc;               // FA-02  PIDЗДРЁдД
    Uint16 pidDir;                  // FA-03  PIDзїгУЗНЯђ
    Uint16 pidDisp;                 // FA-04  PIDИјЖЈЗДРЁСПГЬ
    
    Uint16 pidKp;                   // FA-05  БШР§дівцP
    Uint16 pidTi;                   // FA-06  Л§ЗжЪБМфI
    Uint16 pidTd;                   // FA-07  ЮЂЗжЪБМфD
    Uint16 reverseCutOffFrq;        // FA-08  PIDЗДзЊНижЙЦЕТЪ
    Uint16 pidErrMin;               // FA-09  PIDЦЋВюМЋЯо
    Uint16 pidDLimit;               // FA-10  PIDЮЂЗжЯоЗљ
    Uint16 pidSetChangeTime;        // FA-11  PIDИјЖЈБфЛЏЪБМф
    Uint16 pidFdbLpfTime;           // FA-12  PIDЗДРЁТЫВЈЪБМф
    Uint16 pidOutLpfTime;           // FA-13  PIDЪфГіТЫВЈЪБМф
    Uint16 pidSampleTime;           // FA-14  PIDВЩбљжмЦк(днЮДзі)
    Uint16 pidKp2;                  // FA-15  PIDБШР§дівцP2
    Uint16 pidTi2;                  // FA-16  PIDЛ§ЗжЪБМфI2
    Uint16 pidTd2;                  // FA-17  PIDЮЂЗжЪБМфD2
    Uint16 pidParaChgCondition;     // FA-18  PIDВЮЪ§ЧаЛЛЬѕМў
    Uint16 pidParaChgDelta1;        // FA-19  PIDВЮЪ§ЧаЛЛЦЋВю1
    Uint16 pidParaChgDelta2;        // FA-20  PIDВЮЪ§ЧаЛЛЦЋВю2
    Uint16 pidInit;                 // FA-21  PIDГѕжЕ
    Uint16 pidInitTime;             // FA-22  PIDГѕжЕБЃГжЪБМф
    Uint16 pidOutDeltaMax;          // FA-23  PIDСНДЮЪфГіжЎМфЦЋВюЕФзюДѓжЕ
    Uint16 pidOutDeltaMin;          // FA-24  PIDСНДЮЪфГіжЎМфЦЋВюЕФзюаЁжЕ
    Uint16 pidIAttribute;           // FA-25  PIDЛ§ЗжЪєад
    Uint16 pidFdbLoseDetect;        // FA-26  PIDЗДРЁЖЊЪЇМьВтжЕ
    Uint16 pidFdbLoseDetectTime;    // FA-27  PIDЗДРЁЖЊЪЇМьВтЪБМф
    Uint16 pidCalcMode;             // FA-28  PIDдЫЫуФЃЪН(ЭЃЛњЪЧЗёдЫЫу). ЙЉЫЎФЃЪНЯТЃЌЭЃЛњЪБPIDвВМЦЫу.

//======================================
// FB АкЦЕЁЂЖЈГЄКЭМЦЪ§
    Uint16 swingBaseMode;           // FB-00  АкЦЕЩшЖЈЗНЪН
    Uint16 swingAmplitude;          // FB-01  АкЦЕЗљЖШ
    Uint16 swingJumpRange;          // FB-02  ЭЛЬјЦЕТЪЗљЖШ
    Uint16 swingPeriod;             // FB-03  АкЦЕжмЦк
    Uint16 swingRiseTimeCoeff;      // FB-04  АкЦЕЕФШ§НЧВЈЩЯЩ§ЪБМф
    Uint16 lengthSet;               // FB-05  ЩшЖЈГЄЖШ
    Uint16 lengthCurrent;           // FB-06  ЪЕМЪГЄЖШ
    Uint16 lengthPulsePerMeter;     // FB-07  УПУзТіГхЪ§ЃЌЕЅЮЛ: 0.1
    Uint16 counterSet;              // FB-08  ЩшЖЈМЦЪ§жЕ
    Uint16 counterPoint;            // FB-09  жИЖЈМЦЪ§жЕ

//======================================
// FC ЖрЖЫЫйЁЂPLC
    Uint16 plcFrq[PLC_STEP_MAX];                  // FC-00  --FC-15   ЖрЖЮжИСю0-ЖрЖЮжИСю15
    Uint16 plcRunMode;                  // FC-16  PLCдЫааЗНЪН
    Uint16 plcPowerOffRemMode;          // FC-17  PLCЕєЕчМЧвфбЁдё
    struct PLC_STRUCT plcAttribute[PLC_STEP_MAX]; // FC-18  --FC-49   PLCдЫааЪБМфЃЌМгМѕЫйЪБМфбЁдё
    Uint16 plcTimeUnit;                 // FC-50  PLCдЫааЪБМфЕЅЮЛ
    Uint16 plcFrq0Src;                  // FC-51  ЖрЖЮжИСю0ИјЖЈЗНЪН

// FD ЭЈбЖВЮЪ§
    Uint16 commBaudRate;            // FD-00  ВЈЬиТЪ
    Uint16 commParity;              // FD-01  Ъ§ОнИёЪН
    Uint16 commSlaveAddress;        // FD-02  БОЛњЕижЗ
    Uint16 commDelay;               // FD-03  гІД№бгГй
    Uint16 commOverTime;            // FD-04  ЭЈбЖГЌЪБЪБМф
    Uint16 commProtocol;            // FD-05  ЭЈбЖЪ§ОнДЋЫЭИёЪНбЁдё   
    Uint16 commReadCurrentPoint;    // FD-06  ЭЈбЖЖСШЁЕчСїЗжБцТЪ
    Uint16 commMaster;              // FD-07  ЭЈбЖжїДгЗНЪН

// FE  280га320УЛгаЕФЙІФмТы
    Uint16 userCustom[FENUM];       // FE гУЛЇЖЈжЦЙІФмТызщ

// FF ГЇМвВЮЪ§
    Uint16 factoryPassword;         // FF-00  ГЇМвУмТы
    Uint16 inverterType;            // FF-01  БфЦЕЦїЛњаЭ
    Uint16 inverterGpType;          // FF-02  G/PаЭКХ
    Uint16 inverterPower;           // FF-03  БфЦЕЦїЙІТЪ
    Uint16 tempCurve;               // FF-04  ЮТЖШЧњЯп
    
    Uint16 uvGainWarp;              // FF-05  UVСНЯрЕчСїВЩбљдівцЦЋВю
    Uint16 funcSoftVersion;         // FF-06  БЃСє
    Uint16 motorSoftVersion;        // FF-07  адФмШэМўАцБОКХ
    Uint16 volJudgeCoeff;           // FF-08  ЕчбЙаЃе§ЯЕЪ§
    Uint16 curJudgeCoeff;           // FF-09  ЕчСїаЃе§ЯЕЪ§
    
    Uint16 motorDebugFc;            // FF-10  адФмЕїЪдЙІФмТыЯдЪОИіЪ§
    Uint16 aiaoCalibrateDisp;       // FF-11  AIAOаЃе§ЙІФмТыЯдЪО
    Uint16 memoryAddr;              // FF-12  ФкДцЕижЗВщПД

// FP гУЛЇУмТы, ВЮЪ§ГѕЪМЛЏ
    Uint16 userPassword;            // FP-00  гУЛЇУмТы
    Uint16 paraInitMode;            // FP-01  ВЮЪ§ГѕЪМЛЏ
    Uint16 funcParaView;            // FP-02  ЙІФмВЮЪ§ФЃЪНЪєад
    Uint16 menuMode;                // FP-03  ИіадЛЏВЮЪ§ФЃЪНбЁдё
    
    Uint16 userPasswordReadOnly;    // FP-04  жЛЖСгУЛЇУмТы
    Uint16 rsvdFp;                  // FP-05  БЃСє

// A0 зЊОиПижЦКЭЯоЖЈВЮЪ§
    Uint16 torqueCtrl;              // A0-00  зЊОиПижЦ
    Uint16 driveUpperTorqueSrc;     // A0-01  Ч§ЖЏзЊОиЩЯЯодД
    Uint16 brakeUpperTorqueSrc;     // A0-02  жЦЖЏзЊОиЩЯЯодД
    Uint16 driveUpperTorque;        // A0-03  Ч§ЖЏзЊОиЩЯЯо
    Uint16 torqueFilter;            // A0-04  зЊОиТЫВЈ
    Uint16 torqueCtrlFwdMaxFrq;     // A0-05  зЊОиПижЦе§ЯђзюДѓЦЕТЪ
    Uint16 torqueCtrlRevMaxFrq;     // A0-06  зЊОиПижЦЗДЯђзюДѓЦЕТЪ
    Uint16 torqueCtrlAccTime;       // A0-07  зЊОиМгЫйЪБМф
    Uint16 torqueCtrlDecTime;       // A0-08  зЊОиМѕЫйЪБМф
    
// A1 ащФтDIЁЂащФтDO
    Uint16 vdiFunc[5];              // A1-00  --A1-04 VDI1ЖЫзгЙІФмбЁдё
    Uint16 vdiSrc;                  // A1-05  VDIЖЫзггааЇзДЬЌРДдД
    Uint16 vdiFcSet;                // A1-06  VDIЖЫзгЙІФмТыЩшЖЈгааЇзДЬЌ
    Uint16 aiAsDiFunc[3];           // A1-07  --A1-09 AI1ЖЫзгЙІФмбЁдёЃЈЕБзїDIЃЉ
    Uint16 diLogicAiAsDi;           // A1-10  AIзїЮЊDIгааЇзДЬЌбЁдё
    Uint16 vdoFunc[5];              // A1-11  --A1-15 ащФтVDO1ЁЋVDO5ЪфГібЁдё
    Uint16 vdoDelayTime[5];         // A1-16  --A1-20 VDO1ЁЋVDO5бгГйЪБМф
    Uint16 vdoLogic;                // A1-21  VDOЪфГіЖЫзггааЇзДЬЌбЁдё
    
// A2 Ек2ЕчЛњВЮЪ§
    struct MOTOR_FC motorFcM2;      // Ек2ЕчЛњВЮЪ§
    
// A3 Ек2ЕчЛњВЮЪ§
    struct MOTOR_FC motorFcM3;      // Ек3ЕчЛњВЮЪ§
    
// A4 Ек2ЕчЛњВЮЪ§
    struct MOTOR_FC motorFcM4;      // Ек4ЕчЛњВЮЪ§
    
// A5 ПижЦгХЛЏВЮЪ§
    Uint16 pwmMode;                 // A5-00    DPWMЧаЛЛЩЯЯоЦЕТЪ
    Uint16 modulationMode;          // A5-01    ЕїжЦЗНЪНЃЌ0-вьВНЕїжЦЃЌ1-ЭЌВНЕїжЦ
    Uint16 deadCompMode;            // A5-02    ЫРЧјВЙГЅФЃЪНбЁдё
    Uint16 softPwm;                 // A5-03    ЫцЛњPWM
    Uint16 cbcEnable;               // A5-04    ж№ВЈЯоСїЪЙФм
    Uint16 curSampleDelayComp;      // A5-05    ЕчСїМьВтбгЪБВЙГЅ
    Uint16 uvPoint;                 // A5-06    ЧЗбЙЕуЩшжУ
    Uint16 svcMode;                 // A5-07    SVCгХЛЏбЁдё 0-ВЛгХЛЏ  1-гХЛЏФЃЪН1  2-гХЛЏФЃЪН2
    Uint16 deadTimeSet;             // A5-08    ЫРЧјЪБМфЕїећ-1140VзЈгУ
    Uint16 ovPointSet;              // A5-09    Й§бЙЕуЩшжУ

      
//======================================
// A6 ФЃФтСПЧњЯп
    Uint16 curveSet4P1[8];          // A6-00    --A6-07  ЧњЯп4ЃЌ4ЕуЃЌзюДѓжЕЃЌзюаЁжЕЃЌ2ИіжаМфЕу
    Uint16 curveSet4P2[8];          // A6-08    --A6-15  ЧњЯп5ЃЌ4Еу
    Uint16 rsvdA41[8];

    struct AI_JUMP aiJumpSet[AI_NUMBER]; // A6-24 --A6-29, AI1, AI2, AI3ЬјдО

// A7 БЃСє               
    Uint16 plcEnable;               // A7-00 PLCПЈЙІФмбЁдё
    Uint16 outPortControl;          // A7-01 ЪфГіЖЫзгПижЦ
    Uint16 plcAI3Cfg;               // A7-02 PLC AI3ЙІФмХфжУ
    Uint16 fmpValue;                // A7-03 FMPЪфГі 
    Uint16 ao1Value;                // A7-04 AO1ЪфГі
    Uint16 inPortOut;               // A7-05 ПЊЙиСПЪфГі
    Uint16 plcFrqSet;               // A7-06 PLCПЈЦЕТЪИјЖЈ
    Uint16 plcTorqueSet;            // A7-07 PLCПЈзЊОиИјЖЈ
    Uint16 plcCmd;                  // A7-08 PLCПЈУќСюИјЖЈ
    Uint16 plcErrorCode;            // A7-09 PLCПЈЙЪеЯИјЖЈ
    Uint16 rsvdA7[2];

    
// A8 БЃСє  
    Uint16 p2pEnable;               // A8-00 ЕуЖдЕуЭЈбЖЙІФмбЁдё
    Uint16 p2pTypeSel;              // A8-01 жїДгбЁдё
    Uint16 p2pSendDataSel;          // A8-02 жїЛњЗЂЫЭЪ§Он   0:ЪфГізЊОи  1:дЫааЦЕТЪ  2:ЩшЖЈЦЕТЪ  3:ЗДРЁЫйЖШ
    Uint16 p2pRevDataSel;           // A8-03 ДгЛњНгЪеЪ§Он   0:зЊОиИјЖЈ  1:ЦЕТЪИјЖЈ  
    Uint16 p2pRevOffset;            // A8-04 НгЪмЪ§ОнСуЦЋ
    Uint16 p2pRevGain;              // A8-05 НгЪеЪ§Ондівц
    Uint16 p2pOverTime;             // A8-06 ЕуЖдЕуЭЈбЖжаЖЯМьВтЪБМф
    Uint16 p2pSendPeriod;           // A8-07 ЕуЖдЕуЭЈбЖжїЛњЪ§ОнЗЂЫЭжмЦк
    
// A9 БЃСє  
    Uint16 A9[A9NUM];               // A9

// AA ЪИСПгХЛЏВЮЪ§

    Uint16 AA[AANUM];               // AA
    #if 0
    Uint16 motorCtrlM1;             // AA-00 РјДХЕїећЗНЪН
    Uint16 motorCtrlM2;             // AA-01 зюДѓЕчбЙМЦЫуЗНЪН
    Uint16 motorCtrlM3;             // AA-02 РјДХЕчСїЕїНкЦїKP
    Uint16 motorCtrlM4;             // AA-03 РјДХЕчСїЕїНкЦїKI
    Uint16 motorCtrlM5;             // AA-04 РјДХЕчСїе§Яђаое§СП
    Uint16 motorCtrlM6;             // AA-05 РјДХЕчСїЗДЯђаое§СП
    Uint16 motorCtrlM7;             // AA-06 зЊВюЕїНкЩЯЯо
    Uint16 motorCtrlM8;             // AA-07 зЊВюЕїНкдівц
    Uint16 motorCtrlM9;             // AA-08 ЛЅИадівц
    Uint16 motorCtrlM10;            // AA-09 ЪфГіЦЕТЪаое§ФЃЪН
    Uint16 motorCtrlM11;            // AA-10 ЕчбЙаое§уажЕЕїећ
    Uint16 motorCtrlM12;            // AA-11 ЕчбЙаое§дівц
    Uint16 motorCtrlM13;            // AA-12 ЫйЖШЛЗЕїећ
    Uint16 motorCtrlM14;            // AA-13 а§БфМьВтТЫВЈ
    Uint16 motorCtrlM15;            // AA-14 а§БфНЧЖШВЙГЅ
    Uint16 motorCtrlM16;            // AA-15 SVCзЊОиПижЦгХЛЏ
    #endif
// AB VFгХЛЏВЮЪ§    
    Uint16 AB[ABNUM];                // AB
    #if 0
    Uint16 vfCtrlM2;                // AB-01 DPWMЧаЛЛЯТЯоЦЕТЪ   86
    Uint16 vfCtrlM3;                // AB-02 ЫРЧјВЙГЅгХЛЏПЊЦє   87
    Uint16 vfCtrlM4;                // AB-03 ЫРЧјЧЏЮЛВЙГЅЯЕЪ§    1
    Uint16 vfCtrlM5;                // AB-04 ЧЏЮЛгХЛЏЯТЯоЦЕТЪ   101
    Uint16 vfCtrlM6;                // AB-05 ЧЏЮЛгХЛЏЩЯЯоЦЕТЪ   102
    Uint16 vfCtrlM7;                // AB-06 еёЕДвжжЦФЃЪН       89
    Uint16 vfCtrlM8;                // AB-07 еёЕДвжжЦЗљжЕЕїећ   90
    #endif
// AC AIAOаЃе§
    struct ANALOG_CALIBRATE_CURVE aiCalibrateCurve[AI_NUMBER];  // AC-00    ----AC-11, AI1/2/3аЃе§ЧњЯп
    struct ANALOG_CALIBRATE_CURVE aoCalibrateCurve[AO_NUMBER];  // AC-12    ----AC-19, AO1/AO2аЃе§ЧњЯп
    
// AD БЃСє    
    Uint16 AD[ADNUM]; 

// AE AIAOГіГЇаЃе§жЕ
    struct ANALOG_CALIBRATE_CURVE aiFactoryCalibrateCurve[AI_NUMBER];   // AE-00 
    struct ANALOG_CALIBRATE_CURVE aoFactoryCalibrateCurve[AO_NUMBER];   // AE-12

    Uint16 AF[AFNUM];               // AF
                                    
//======================================
    Uint16 b0[B0NUM];               // B0
    Uint16 b1[B1NUM];               // B1
    Uint16 b2[B2NUM];               // B2
    Uint16 b3[B3NUM];               // B3

//======================================
    Uint16 b4[B4NUM];               // B4
    Uint16 b5[B5NUM];               // B5
    Uint16 b6[B6NUM];               // B6
    Uint16 b7[B7NUM];               // B7
    
//======================================
    Uint16 b8[B8NUM];               // B8
    Uint16 b9[B9NUM];               // B9
    Uint16 ba[BANUM];               // BA
    Uint16 bb[BBNUM];               // BB

//======================================
    Uint16 bc[BCNUM];               // BC
    Uint16 bd[BDNUM];               // BD
    Uint16 be[BENUM];               // BE
    Uint16 bf[BFNUM];               // BF
//======================================


//======================================
    Uint16 c0[C0NUM];               // C0
    Uint16 c1[C1NUM];               // C1
    Uint16 c2[C2NUM];               // C2
    Uint16 c3[C3NUM];               // C3

//======================================
    Uint16 c4[C4NUM];               // C4
    Uint16 c5[C5NUM];               // C5
    Uint16 c6[C6NUM];               // C6
    Uint16 c7[C7NUM];               // C7

//======================================
    Uint16 c8[C8NUM];               // C8
    Uint16 c9[C9NUM];               // C9
    Uint16 ca[CANUM];               // CA
    Uint16 cb[CBNUM];               // CB

//======================================
    Uint16 cc[CCNUM];               // CC   
    Uint16 cd[CDNUM];               // CD
    Uint16 ce[CENUM];               // CE
    Uint16 cf[CFNUM];               // CF
//======================================

//======================================
// eepromCheckWord
    Uint16 rsvd4All;                // БЃСєЃЌЗХдкзюЧАУц
    Uint16 eepromCheckWord1;        //        eepromCheckWord1
    Uint16 eepromCheckWord2;        //        eepromCheckWord2
    Uint16 aiaoChkWord;             // AIAOГіГЇаЃе§

//======================================
// REMEMBER ЕєЕчБЃДцЃЌЙВ48Иі
    Uint16 extendType;                  // FR-00  extendType
    Uint16 plcStepRem;                  // FR-01  PLCЕБЧАstep
    Uint16 plcTimeHighRem;              // FR-02  PLCЕБЧАstepдЫааЕФЪБМфЃЌИпЮЛ
    Uint16 plcTimeLowRem;               // FR-03  PLCЕБЧАstepдЫааЕФЪБМфЃЌЕЭЮЛ
    Uint16 dispParaRunBit;              // FR-04  дЫааЪБLEDЯдЪОВЮЪ§ЕФbitЮЛжЕ
    Uint16 dispParaStopBit;             // FR-05  ЭЃЛњЪБLEDЯдЪОВЮЪ§ЕФbitЮЛжУ
    Uint16 runTimeAddupSec;             // FR-06  РлМЦдЫааЪБМфЕФs(Уы)
